zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN947VAB-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXN947VAB/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXN947VDF-pinctrl.h with this part's differences applied
 * below (255 removed, 0 changed,
 * 13 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 5c1d4a3d156c0945
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXN947VAB_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXN947VAB_WRAPPER_

#include "MCXN947VDF-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_B10_PIO0_10
#undef ADC0_B11_PIO0_11
#undef ADC0_B12_PIO0_12
#undef ADC0_B13_PIO0_13
#undef ADC0_B14_PIO0_14
#undef ADC0_B16_PIO0_24
#undef ADC0_B17_PIO0_25
#undef ADC0_B18_PIO0_26
#undef ADC0_B19_PIO0_27
#undef ADC0_B20_PIO0_28
#undef ADC0_B21_PIO0_29
#undef ADC0_B22_PIO0_30
#undef ADC0_B23_PIO0_31
#undef ADC0_B8_PIO0_8
#undef ADC0_B9_PIO0_9
#undef ADC1_A16_PIO1_16
#undef ADC1_A17_PIO1_17
#undef ADC1_A18_PIO1_18
#undef ADC1_A19_PIO1_19
#undef ADC1_A20_PIO1_20
#undef ADC1_A21_PIO1_21
#undef ADC1_A22_PIO1_22
#undef ADC1_A23_PIO1_23
#undef ADC1_B16_PIO5_8
#undef ADC1_B17_PIO5_9
#undef CAN0_RXD_PIO1_19
#undef CAN0_TXD_PIO1_18
#undef CAN1_RXD_PIO1_21
#undef CAN1_TXD_PIO1_20
#undef CMP1_IN3_PIO1_20
#undef CMP2_IN1_PIO0_7
#undef CMP2_IN3_PIO1_21
#undef CT0_MAT0_PIO0_10
#undef CT0_MAT0_PIO0_24
#undef CT0_MAT1_PIO0_11
#undef CT0_MAT1_PIO0_25
#undef CT0_MAT2_PIO0_12
#undef CT0_MAT2_PIO0_26
#undef CT0_MAT3_PIO0_13
#undef CT0_MAT3_PIO0_27
#undef CT2_MAT0_PIO3_18
#undef CT2_MAT1_PIO3_19
#undef CT2_MAT2_PIO4_22
#undef CT3_MAT0_PIO1_18
#undef CT3_MAT1_PIO1_19
#undef CT3_MAT2_PIO1_20
#undef CT3_MAT2_PIO4_18
#undef CT3_MAT3_PIO1_21
#undef CT4_MAT1_PIO3_3
#undef CT4_MAT2_PIO4_14
#undef CT_INP0_PIO0_28
#undef CT_INP0_PIO0_8
#undef CT_INP10_PIO3_22
#undef CT_INP11_PIO3_23
#undef CT_INP12_PIO1_16
#undef CT_INP13_PIO1_17
#undef CT_INP14_PIO1_22
#undef CT_INP15_PIO1_23
#undef CT_INP18_PIO3_4
#undef CT_INP19_PIO3_5
#undef CT_INP1_PIO0_29
#undef CT_INP1_PIO0_9
#undef CT_INP2_PIO0_14
#undef CT_INP2_PIO0_30
#undef CT_INP3_PIO0_31
#undef CT_INP3_PIO0_7
#undef ENET0_COL_PIO1_18
#undef ENET0_CRS_PIO1_19
#undef ENET0_MDC_PIO1_20
#undef ENET0_MDIO_PIO1_21
#undef ENET0_RXD2_PIO1_16
#undef ENET0_RXD3_PIO1_17
#undef FC0_P0_PIO0_12
#undef FC0_P1_PIO0_13
#undef FC0_P2_PIO0_14
#undef FC0_P3_PIO0_7
#undef FC0_P4_PIO0_28
#undef FC0_P4_PIO0_8
#undef FC0_P5_PIO0_29
#undef FC0_P5_PIO0_9
#undef FC0_P6_PIO0_10
#undef FC0_P6_PIO0_30
#undef FC1_P0_PIO0_24
#undef FC1_P1_PIO0_25
#undef FC1_P2_PIO0_26
#undef FC1_P3_PIO0_27
#undef FC1_P4_PIO0_12
#undef FC1_P4_PIO0_28
#undef FC1_P5_PIO0_13
#undef FC1_P5_PIO0_29
#undef FC1_P6_PIO0_14
#undef FC1_P6_PIO0_30
#undef FC3_P4_PIO1_16
#undef FC3_P5_PIO1_17
#undef FC3_P6_PIO1_18
#undef FC4_P0_PIO1_20
#undef FC4_P1_PIO1_21
#undef FC4_P2_PIO1_22
#undef FC4_P3_PIO1_23
#undef FC5_P0_PIO1_16
#undef FC5_P1_PIO1_17
#undef FC5_P2_PIO1_18
#undef FC5_P3_PIO1_19
#undef FC5_P4_PIO1_20
#undef FC5_P5_PIO1_21
#undef FC5_P6_PIO1_22
#undef FC6_P2_PIO3_22
#undef FC6_P3_PIO3_23
#undef FC6_P6_PIO3_18
#undef FC7_P1_PIO3_3
#undef FC7_P2_PIO3_4
#undef FC7_P3_PIO3_5
#undef FC7_P6_PIO3_19
#undef FC8_P6_PIO3_22
#undef FLEXIO0_D0_PIO0_8
#undef FLEXIO0_D11_PIO3_3
#undef FLEXIO0_D12_PIO3_4
#undef FLEXIO0_D13_PIO3_5
#undef FLEXIO0_D18_PIO2_10
#undef FLEXIO0_D19_PIO2_11
#undef FLEXIO0_D1_PIO0_9
#undef FLEXIO0_D22_PIO4_14
#undef FLEXIO0_D24_PIO1_16
#undef FLEXIO0_D25_PIO1_17
#undef FLEXIO0_D26_PIO1_18
#undef FLEXIO0_D26_PIO3_18
#undef FLEXIO0_D26_PIO4_18
#undef FLEXIO0_D27_PIO1_19
#undef FLEXIO0_D27_PIO3_19
#undef FLEXIO0_D28_PIO1_20
#undef FLEXIO0_D29_PIO1_21
#undef FLEXIO0_D2_PIO0_10
#undef FLEXIO0_D30_PIO1_22
#undef FLEXIO0_D30_PIO3_22
#undef FLEXIO0_D30_PIO4_22
#undef FLEXIO0_D31_PIO1_23
#undef FLEXIO0_D31_PIO3_23
#undef FLEXIO0_D3_PIO0_11
#undef FLEXIO0_D4_PIO0_12
#undef FLEXIO0_D5_PIO0_13
#undef FLEXIO0_D6_PIO0_14
#undef FLEXSPI0_B_DATA6_PIO2_10
#undef FLEXSPI0_B_DATA7_PIO2_11
#undef FREQME_CLK_IN0_PIO1_18
#undef FREQME_CLK_IN1_PIO1_19
#undef HSCMP2_OUT_PIO0_11
#undef I3C1_SCL_PIO1_17
#undef I3C1_SDA_PIO1_16
#undef PIO0_10
#undef PIO0_11
#undef PIO0_12
#undef PIO0_13
#undef PIO0_14
#undef PIO0_24
#undef PIO0_25
#undef PIO0_26
#undef PIO0_27
#undef PIO0_28
#undef PIO0_29
#undef PIO0_30
#undef PIO0_31
#undef PIO0_7
#undef PIO0_8
#undef PIO0_9
#undef PIO1_16
#undef PIO1_17
#undef PIO1_18
#undef PIO1_19
#undef PIO1_20
#undef PIO1_21
#undef PIO1_22
#undef PIO1_23
#undef PIO2_10
#undef PIO2_11
#undef PIO3_18
#undef PIO3_19
#undef PIO3_22
#undef PIO3_23
#undef PIO3_3
#undef PIO3_4
#undef PIO3_5
#undef PIO4_14
#undef PIO4_18
#undef PIO4_22
#undef PIO5_8
#undef PIO5_9
#undef PLU_IN4_PIO1_18
#undef PLU_IN5_PIO1_19
#undef PLU_OUT2_PIO4_14
#undef PLU_OUT4_PIO1_16
#undef PLU_OUT5_PIO1_17
#undef PLU_OUT6_PIO1_20
#undef PLU_OUT6_PIO4_18
#undef PLU_OUT7_PIO1_21
#undef PWM0_X1_PIO3_3
#undef PWM0_X2_PIO3_4
#undef PWM0_X3_PIO3_5
#undef PWM1_X0_PIO3_18
#undef PWM1_X1_PIO3_19
#undef PWM1_X2_PIO2_10
#undef PWM1_X2_PIO3_22
#undef PWM1_X3_PIO2_11
#undef PWM1_X3_PIO3_23
#undef SAI1_MCLK_PIO1_21
#undef SAI1_RXD1_PIO2_10
#undef SAI1_RXD1_PIO3_22
#undef SAI1_RX_BCLK_PIO3_18
#undef SAI1_RX_FS_PIO3_19
#undef SAI1_TXD1_PIO2_11
#undef SAI1_TXD1_PIO3_23
#undef SCT0_IN4_PIO2_10
#undef SCT0_IN5_PIO2_11
#undef SCT0_IN6_PIO1_18
#undef SCT0_IN7_PIO1_19
#undef SCT0_OUT4_PIO1_22
#undef SCT0_OUT5_PIO1_23
#undef SCT0_OUT6_PIO1_16
#undef SCT0_OUT7_PIO1_17
#undef SCT0_OUT8_PIO1_20
#undef SCT0_OUT9_PIO1_21
#undef SIM0_VCCEN_PIO3_22
#undef SIM1_CLK_PIO3_4
#undef SIM1_IO_PIO3_5
#undef SIM1_RST_PIO3_3
#undef SINC0_MBIT4_PIO2_11
#undef SINC0_MCLK4_PIO2_10
#undef SMARTDMA_PIO12_PIO1_16
#undef SMARTDMA_PIO13_PIO1_17
#undef SMARTDMA_PIO14_PIO1_18
#undef SMARTDMA_PIO15_PIO1_19
#undef SMARTDMA_PIO16_PIO1_20
#undef SMARTDMA_PIO17_PIO1_21
#undef SMARTDMA_PIO18_PIO1_22
#undef SMARTDMA_PIO18_PIO3_18
#undef SMARTDMA_PIO19_PIO1_23
#undef SMARTDMA_PIO19_PIO3_19
#undef SMARTDMA_PIO22_PIO3_22
#undef SMARTDMA_PIO23_PIO3_23
#undef SMARTDMA_PIO30_PIO2_11
#undef SMARTDMA_PIO31_PIO2_10
#undef SMARTDMA_PIO3_PIO3_3
#undef SMARTDMA_PIO4_PIO3_4
#undef SMARTDMA_PIO5_PIO3_5
#undef TAMPER6_PIO5_8
#undef TAMPER7_PIO5_9
#undef TRACE_DATA2_PIO2_10
#undef TRACE_DATA3_PIO2_11
#undef TRIG_IN2_PIO1_20
#undef TRIG_IN3_PIO1_22
#undef TRIG_OUT2_PIO1_21
#undef TRIG_OUT7_PIO5_8
#undef UTICK_CAP0_PIO0_14
#undef WUU0_IN14_PIO1_16
#undef WUU0_IN15_PIO1_19
#undef WUU0_IN1_PIO0_7

/* Signals specific to this part */
#define ADC0_A0_PIO4_0 N9X_MUX('4',0,0)
#define ADC0_A3_PIO4_6 N9X_MUX('4',6,0)
#define ADC0_A7_PIO4_7 N9X_MUX('4',7,0)
#define ADC0_B0_PIO4_1 N9X_MUX('4',1,0)
#define ADC1_A0_PIO4_4 N9X_MUX('4',4,0)
#define ADC1_A3_PIO4_6 N9X_MUX('4',6,0)
#define ADC1_A7_PIO4_7 N9X_MUX('4',7,0)
#define ADC1_B0_PIO4_5 N9X_MUX('4',5,0)
#define DAC2_OUT_PIO4_6 N9X_MUX('4',6,0)
#define OPAMP0_INN_PIO4_13 N9X_MUX('4',13,0)
#define OPAMP1_INN_PIO4_17 N9X_MUX('4',17,0)
#define OPAMP2_INN_PIO4_21 N9X_MUX('4',21,0)
#define VREFO_PIO4_7 N9X_MUX('4',7,0)

#endif /* _ZEPHYR_DTS_BINDING_MCXN947VAB_WRAPPER_ */
